#Задание 1

print("Сумма чисел\nВведите первое число")
a_n1 = int(input())

print("Введите второе число")
a_n2 = int(input())

a_sum = a_n1 + a_n2

print("Ответ:", a_sum)

input("Нажмите что-бы продожить")

print("Произведение чисел\nВведите первое число")
b_n1 = int(input())

print("Введите второе число")
b_n2 = int(input())

b_sum = b_n1 * b_n2

print("Ответ:", b_sum)

input("Нажмите что-бы закрыть")


#Задание 2

print("Введите свою зарплату в месяц")
money = int(input())

print("Месячный платеж по кредиту в банке")
bank = int(input())

print("Задолженность за коммунальные услуги")
kom_uslugi = int(input())

itogo = money - bank - kom_uslugi

print("У вас останется:",itogo,"рублей")

input("Нажмите что-бы закрыть")


#Задание 3

print("Введите первую диагональ ромба")
d1 = int(input())

print("Введите вторую диагональ ромба")
d2 = int(input())

a = d1 * d2 / 2
print("Ответ:",a)
input("Нажмите что-бы закрыть")


#Задание 4

print("\t\t\t\t\t\t\tTo be\n\t\t\t\t\t\t\tor not\n\t\t\t\t\t\t\tto be")

input("Нажмите что-бы закрыть")


#Задание 5

print('\t“Life is what happens\n\t\twhen\n\t\t\tyou’re busy making other plans”\n\t\t\t\t\t\tJohn Lennon.')

input("Нажмите что-бы закрыть")