x = 21
if x==20: #условие
    print("х равно 20") #действие, если условие выполнилось

y = 5
if y==10: #условие
    print("y равен 10")#действие, если условие выполнилось
else:
    print("y равен ", y)#действие, если НЕ условие выполнилось

z = 10
if z ==30: #true
    print("z == 30")
if z>15: #true
    print("z > 15")
elif z>10: #true
    print("z > 10")
elif z<10:
    print("z < 10")
else:
    print("else не будет выполнен")
'''
if y%2==0 #проверка числа на четность
if y%2!=0 #проверка числа на нечетность
'''
input()
